# UniformatCode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..UniformatCode Property
ParameterTypeId Class See Also
---
"Assembly Code"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId UniformatCode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UniformatCode As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ UniformatCode {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace